# 4장 여러가지 유형의 데이터 다루기

#4-1 값과 유형

'''
비트와 바이트

비트 - 컴퓨터가 전압이 높은 상태와 낮은 상태를 구분하여 이를 0과 1로 구별하는 정보 단위

개념 정리
비트: 두 가지 상태를 구별할 수 있는 정보의 단위
바이트: 비트 여덟 개를 묶은 것. 256가지 상태를 구별할 수 있다.
'''

'''
부호화
컴퓨터는 다양한 데이터 형식을 다루는데 이런 데이터 형식을 다룰 때 정해둔 약속에 따라서 
비트로 나타낸다. 
이렇게 정해둔 약속에 따라 정보를 비트로 나타내는 것을 부호화(encoding)라고 한다.


데이터는 값과 유형으로 구성된다.
데이터 = 값 * 유형 
-> 값과 유형에 따라서 다른 데이터가 된다 
데이터를 다루기 위해서는 각 유형별 특징들을 알고 있어야 한다 

1 * 글자 = '1'
1 * 숫자 = 1 

숫자는 사칙연산 가능 , 글자는 불가능 

값: 비트로 표현된 정보
유형: 그 비트를 취급하는 방법


개념 정리

부호화 : 정해둔 약속에 따라 다양한 정보를 비트로 나타내는 것
값: 비트로 표현된 정보
유형: 그 비트를 취급하는 방법

운영 체제, 프로그래밍 언어, 라이브러리가 부호화 처리를 해준다고 한다. 
'''

