#함수란 무엇인가?

'''
큰 문제를 풀 때 문제를 한 번에 푸는 게 너무 어려울 수 있음

큰 문제를 작은 문제로 쪼개고 그 작은 문제들 각각을 함수라 한다

예를 들어 8퍼센트 대출 받기의 과정을 함수로 풀어 보면 아래처럼 정리해볼 수 있다

대출 신청하기
    1. 홈페이지에서 금리 한도 조회를 클릭한다
    2. 대출 관련 정보를 입력한다
    3. 신용조회를 진행한다
    4. 관련 서류를 제출한다

대출 심사받기
    1. 심사자가 서류의 진위 여부를 확인한다
    2. 심사자가 서류의 소득 정보를 바탕으로 심사를 진행한다
    3. 심사자가 KCB 신용 등급 조회 , 사기 의심 여부 등을 체크 한다.
    4. 승인 메일 발송

계약서 작성하기
    1. 승인 메일에서 간편계약서 작성하기 링크 클릭
    2. 추가적인 대출 정보 입력

녹취계약하기
    1. 심사자가 전화를 발신
    2. 전화 수신 후 녹취 계약 절차 진행

대출 받기
    1. 대출 신청하기
    2. 대출 심사받기
    3. 계약서 작성하기
    4. 녹취 계약하기
    5. 대출금 계좌에서 대출 금액을 확인한다.

위 절차대로 진행되는데 이 절차에는 또 세부적인 내용들이 있음

개념 정리

크고 복잡한 문제는 작고 간단한 문제로 나누어 해결해야 한다.
함수: 작은 문제를 해결하는 작은 프로그램

개념 정리

함수 정의: 어떤 작업을 수행하는 코드를 모아 이름을 붙이는 것
함수 호출: 함수의 이름을 불러 함수의 내용을 실행시키는 것
'''
